Tekla.Structures.Model.Profile
The Profile class defines the form of a cross section.

Tekla.Structures.Model.Profile.ProfileString
The profile in human-readable form.
The profile of a beam is set to standard L profile "L400*200*60":
using Tekla.Structures.Model;
using Tekla.Structures.Geometry3d;
public class Example
{
public void Example1()
{
Point point = new Point(5000, 0, 0);
Point point2 = new Point(7000, 0, 0);
Beam Beam = new Beam(point, point2);
string ParametricProfileSeparator = "*";
string ShapeTypeL = "L";
string LshapeProfileDepth = "400";
string LshapeProfileWidth = "200";
string LshapeProfileThickness = "60";
Beam.Profile.ProfileString = ShapeTypeL;
Beam.Profile.ProfileString += LshapeProfileDepth;
Beam.Profile.ProfileString += ParametricProfileSeparator;
Beam.Profile.ProfileString += LshapeProfileWidth;
Beam.Profile.ProfileString += ParametricProfileSeparator;
Beam.Profile.ProfileString += LshapeProfileThickness;
}
}

Tekla.Structures.Model.Profile.#ctor
Instantiates an empty profile.

Tekla.Structures.Model.Profile.ParseProfileString(System.String)
Parses profile string
profileString: profile string
Returns: Parsed profile string, if not successful returns original string

Tekla.Structures.Model.Profile.FormatProfileString(System.String)
Formats profile string
profileString: profile string
Returns: Formatted profile string, if not successful returns original string

Tekla.Structures.Model.Profile.ToStruct(Tekla.Structures.ModelInternal.dotProfile_t@)
To struct
profile: the profile

Tekla.Structures.Model.Profile.FromStruct(Tekla.Structures.ModelInternal.dotProfile_t@)
From struct
profile: the profile